;Place localized text in this file

[SPARK_InfernoCannon X2WeaponTemplate]
FriendlyName="地狱加农炮"
FriendlyNamePlural="地狱加农炮"
BriefSummary="一个强大的基于火焰的武器系统，可以产生3种不同的火焰模式，火焰喷射器，热束和火焰炸弹。"
TacticalText="<Bullet/> 在缺乏特殊训练的情况下，发射主武器会结束士兵的回合。\n<Bullet/>"
AbilityDescName="Spark火焰喷射器"

[SPARK_FlamestormCannon X2WeaponTemplate]
FriendlyName="火焰风暴加农炮"
FriendlyNamePlural="火焰风暴加农炮"
BriefSummary="一个强大的基于火焰的武器系统，可以产生3种不同的火焰模式，火焰喷射器，热束和火焰炸弹。"
TacticalText="<Bullet/> 在缺乏特殊训练的情况下，发射主武器会结束士兵的回合。\n<Bullet/>"
AbilityDescName="Spark火焰喷射器"

[SPARK_ApocalypseCannon X2WeaponTemplate]
FriendlyName="天启大炮"
FriendlyNamePlural="天启大炮"
BriefSummary="我们的火炮武器系统的最强之作，有3种不同的射击模式，火焰喷射器、热束和火焰炸弹。"
TacticalText="<Bullet/> 在缺乏特殊训练的情况下，发射主武器会结束士兵的回合。\n<Bullet/>"
AbilityDescName="Spark火焰喷射器"

[InfernoCannon X2TechTemplate]
DisplayName="研究Spark火焰喷射器"
Summary="指挥官，在完成了我们对变种人净化器的研究之后，我相信有可能进一步研究他们的武器系统是如何运作的，以便创造一个更强火力的武器系统。"
CodeName="烛光"
LongDescription="指挥官，虽然我们最初的意图是为我们的部队创建一个火焰喷射器武器系统的计划，但我们对净化器设备的研究已经产生了更令人兴奋的结果。不是为我们的部队创造一个更传统的火焰喷射器，这里的工作人员想出了一个计划，为我们的火花创造一个更具破坏性的武器系统。这个被我的同事们昵称为“地狱加农炮”的装置首先是一个“Spark大小的火焰喷射器”，能够释放出巨大数量的火焰，然而我们也提出了两个额外的火焰模式。首先，该装置具有将燃料浓缩成球体的能力，燃料在离开武器枪管时被点燃，并在撞击时爆炸。其次，通过点燃武器内的燃料，并在连续的快速开火前，快速地循环它通过一系列的腔室，武器能够发射“热束”，它的能量应该足够强大，不仅可以绕过装甲，甚至可以在这个过程中摧毁一些。由于这些射击模式，该武器不适合人类操作，但它使一个强大的武器系统在我们的机械化士兵手中。\n\n不幸的是，当我们创建一个原型的研究实验室，我不相信这是适合现场使用，它是有点不稳定，容易失败，因此该设备将会进一步调优，最后，由沈制造和工程团队在试验场。\n\n 里查德·泰根。"
AlertString="地狱加农炮"

[Inferno X2TechTemplate]
DisplayName="地狱加农炮"
Summary="泰根和科学团队创造的Spark地狱炮概念非常有趣，对我们的工程师来说是一个挑战。这种枪有三种射击模式，使它成为一种威力无比、用途广泛的武器。莉莉·沈。"

[Flamestorm X2TechTemplate]
DisplayName="火焰风暴加农炮"
Summary="火焰风暴加农炮是地狱加农炮的升级版本，燃料现在包含了元素的痕迹，磁性技术被用来稳定和压缩燃料，甚至在任何时候都把元素放在武器里作为燃料的催化剂。莉莉·沈。"

[Apocalypse X2TechTemplate]
DisplayName="天启大炮"
Summary="在我们的“Spark火焰喷射器”技术的顶峰，天启大炮实际上是等离子武器。这个装置并没有试图将等离子体控制成光束的形状，而是简单地将“原始”等离子体引导成一股猛烈的气流，充当火焰喷射器。最大的障碍是用等离子体重建“炸弹”，这是我们通过在发射前将数百层等离子体与磁场交织在一起实现的，弹丸在离开大炮时会衰减，但在撞击时会随着惯性力而爆炸。莉莉·沈。"

[SPARK_INFERNO X2AbilityTemplate]
LocFriendlyName="地狱加农炮发射"
LocHelpText="在一个锥形的区域内喷射火焰。"

[SPARK_FLAMESTORM X2AbilityTemplate]
LocFriendlyName="火焰风暴加农炮发射"
LocHelpText="在锥形区域发射火焰风暴。"

[SPARK_APOCALYPSE X2AbilityTemplate]
LocFriendlyName="天启大炮发射"
LocHelpText="在锥形区域喷射等离子火焰。"

[SPARK_INFERNOBOMB X2AbilityTemplate]
LocFriendlyName="地狱炸弹"
LocLongDescription="地狱之炮射出一团点燃的燃料，在撞击时起火爆炸。"
LocHelpText="向一个地区发射一枚燃烧的炮弹"
LocFlyOverText="地狱炸弹"

[SPARK_FLAMESTORMBOMB X2AbilityTemplate]
LocFriendlyName="火焰风暴炸弹"
LocLongDescription="火焰风暴炮发射了两枚点燃的燃料球，这些燃料球剧烈地撞击着地面。"
LocHelpText="向一个地区发射一枚燃烧的炮弹"
LocFlyOverText="火焰风暴炸弹"

[SPARK_APOCALYPSEBOMB X2AbilityTemplate]
LocFriendlyName="天启炸弹"
LocLongDescription="天启大炮发射一种毁灭性的等离子体炮弹，在撞击时爆炸。"
LocHelpText="向一个地区发射一枚燃烧的炮弹"
LocFlyOverText="火焰风暴炸弹"

[SPARK_INFERNOBEAM X2AbilityTemplate]
LocFriendlyName="地狱热光束"
LocLongDescription="地狱加农炮投射出的热束可以在短射程内对装甲造成火焰伤害。"
LocHelpText="发射一束可以无视并撕碎护甲的能量。"
LocFlyOverText="地狱热光束"

[SPARK_FLAMESTORMBEAM X2AbilityTemplate]
LocFriendlyName="火焰风暴热光束"
LocLongDescription="火焰风暴加农炮在短距离内投射两道光束，能够通过装甲造成巨大的火力伤害。"
LocHelpText="发射一束可以无视并撕碎护甲的能量。"
LocFlyOverText="火焰风暴热光束"

[SPARK_APOCALYPSEBEAM X2AbilityTemplate]
LocFriendlyName="天启热光速"
LocLongDescription="天启大炮使用等离子体在短射程内发射热束，能够对装甲造成巨大的火力伤害。"
LocHelpText="发射一束可以无视并撕碎护甲的能量。"
LocFlyOverText="天启热光速"
